## OSPF Metric (Cost)

- **Metric Name**: In OSPF, the metric used to determine the best path is called **Cost**.
- **Calculation**: OSPF automatically calculates the cost based on the **bandwidth** (speed) of the interface. The formula is:

$$\text{Cost} = \frac{\text{Reference Bandwidth}}{\text{Interface Bandwidth}}$$

  - **Default Reference Bandwidth**: 100 Mbps here some Example Calculations :


$$ \frac{100 \, \text{Mbps}}{10 \, \text{Mbps}} = \text{Cost of } 10 $$


$$ \frac{100 \, \text{Mbps}}{100 \, \text{Mbps}} = \text{Cost of } 1$$


 $$\frac{100 \, \text{Mbps}}{1000 \, \text{Mbps}} = \text{Cost of } 1$$


$$\frac{100 \, \text{Mbps}}{10000 \, \text{Mbps}} = \text{Cost of } 1$$



  - **Minimum Cost**: If the calculated cost is less than 1, it is rounded up to 1.
  - **Fast Ethernet, Gigabit Ethernet, and Faster Links**: Interfaces with 100 Mbps, 1 Gbps, 10 Gbps, etc., will all have the same cost of 1.

![FastEthernet Cost](27_ospfPart2_01.png)
![Gigabit Ethernet Cost](27_ospfPart2_02.png)

### **Changing the Reference Bandwidth**

- **Command**:

  ```shell
  R1(config-router)# auto-cost reference-bandwidth <megabits-per-second>
  ```

✏️ T*he reference bandwidth is specified in megabits per second (default is 100 Mbps).*

**Example**: 
$$\frac{100000 \, \text{Mbps}}{100 \, \text{Mbps}} = \text{Cost of } 1000 : for FastEthernet$$


$$\frac{100000 \, \text{Mbps}}{1000 \, \text{Mbps}} = \text{Cost of } 100 : for Gig Ethernet$$


  - **Recommendation**: Set the reference bandwidth higher than the fastest links in your network to accommodate future upgrades.
  - **Important**: Changing the reference bandwidth should be done on **all OSPF routers** in the network.

## OSPF Cost to a Destination

- **Total Cost**: The OSPF cost to a destination is the **sum** of the costs of the outgoing (exit) interfaces.
- **Loopback Interfaces**: Default cost is 1.

![OSPF Cost Example](27_ospfPart2_03.png)

## Modifying OSPF Cost

- **Manual Cost Configuration**:

  ```shell
  R1(config-if)# ip ospf cost <cost>
  ```

- **Precedence**: Manually configured costs take precedence over automatically calculated costs.
  
- **Changing Interface Bandwidth**:
  - The OSPF cost can also be altered by changing the interface bandwidth using the `bandwidth` command.
  - **Formula**: 

$$\text{Cost} = \frac{\text{Reference Bandwidth}}{\text{Interface Bandwidth}}$$

  - **Note**: Changing the bandwidth value does not actually change the physical speed of the interface; it only alters the OSPF cost calculation.
  - To change the actual operating speed of the interface, use the `speed` command.

- **Best Practice**:
  - It is recommended to adjust the reference bandwidth rather than the interface bandwidth.
  - Then, use the `ip ospf cost` command for more precise cost adjustments.

![OSPF Cost Adjustment](27_ospfPart2_04.png)

## Summary of OSPF Cost Modifications

1. **Change the Reference Bandwidth**:

   ```shell
   R1(config-router)# auto-cost reference-bandwidth <megabits-per-second>
   ```

2. **Manual Configuration**:

   ```shell
   R1(config-router)# ip ospf cost <cost>
   ```

3. **Change the Interface Bandwidth**:

   ```shell
   R1(config-if)# bandwidth <kilobits-per-second>
   ```

![OSPF Cost Modification Methods](27_ospfPart2_05.png)

---

## Becoming OSPF Neighbors

- **Key Task**: Ensuring routers successfully become OSPF neighbors is crucial for configuring and troubleshooting OSPF.
- **Process**:
  - Once routers become neighbors, they automatically share network information and calculate routes.

### Hello Messages
  
- **Activation**: When OSPF is activated on an interface, the router sends out **Hello** messages at regular intervals.
- **Default Interval**: 10 seconds on an Ethernet connection.
- **Destination**: Multicast to **224.0.0.5** (all OSPF routers).
- **Protocol**: OSPF messages are encapsulated in an IP header with a protocol value of **89**.

### OSPF Neighbor States

1. **Down State**:
   - Initial state when OSPF is activated on an interface.
   - Router sends Hello messages but doesn't know about any neighbors yet.

   ![Down State](27_ospfPart2_06.png)

2. **Init State**:
   - When a router receives a Hello packet, it adds the sender to its OSPF neighbor table.
   - The neighbor state is **Init** until the router sees its own Router ID (RID) in a Hello packet from the neighbor.

   ![Init State](27_ospfPart2_07.png)

3. **2-Way State**:
   - Achieved when a router sees its own RID in the Hello packet from the neighbor.
   - At this point, the routers are ready to share LSAs and build a common LSDB.
   - In some networks, this is where DR (Designated Router) and BDR (Backup Designated Router) elections occur.

   ![2-Way State](27_ospfPart2_08.png)

4. **ExStart State**:
   - Routers prepare to exchange information about their LSDB.
   - They must first decide which router will start the exchange (Master/Slave role).
   - The router with the higher RID becomes the Master.

   ![ExStart State](27_ospfPart2_09.png)

5. **Exchange State**:
   - Routers exchange **DBD (Database Description)** packets, which contain a list of the LSAs in their LSDBs.
   - Only basic information about the LSAs is included.

   ![Exchange State](27_ospfPart2_10.png)

6. **Loading State**:
   - Routers send **Link State Requests (LSR)** to request missing LSAs.
   - LSAs are sent in **Link State Update (LSU)** messages.
   - Routers acknowledge receipt of LSAs with **LSAck** messages.

   ![Loading State](27_ospfPart2_11.png)

7. **Full State**:
   - The routers have a full OSPF adjacency and identical LSDBs.
   - They continue to send and listen for Hello packets (every 10 seconds by default) to maintain the neighbor adjacency.
   - If the **Dead timer** (40 seconds by default) reaches zero without receiving a Hello message, the neighbor is removed.
   - Routers will continue to share LSAs as the network changes.

   ![Full State](27_ospfPart2_12.png)

---

## OSPF Neighbors Summary

1. **Become Neighbors**:
   - **Down State**
   - **Init State**
   - **2-Way State** 
   - (DR/BDR Election)

2. **Exchange LSAs**:
   - **ExStart State**
   - **Exchange State**
   - **Loading State**

![OSPF Neighbor States](27_ospfPart2_13.png)

## Summary of OSPF Message Types

![OSPF Message Types](27_ospfPart2_14.png)

---

## Additional OSPF Configurations

### Activate OSPF on an Interface

You can activate OSPF directly on an interface with:

  ```shell
  R1(config-if)# ip ospf <process-id> area <area>
  ```

![OSPF Interface Activation](27_ospfPart2_15.png)

### Configure All Interfaces as Passive

To make all interfaces passive by default:

  ```shell
  R1(config-router)# passive-interface default
  ```

![Passive Interface Default](27_ospfPart2_16.png)

**Exclude Specific Interfaces**:

  ```shell
  R1(config-router)# no passive-interface <interface-id>
  ```

### Different Output in `show ip protocols`

Activating OSPF directly on interfaces will display a different output in `show ip protocols`:

![Show IP Protocols Output](27_ospfPart2_17.png)

**Routing on Interfaces Configured Explicitly (Area #)**: Displays the specific interfaces where OSPF is activated.

#### Viewing the OSPF LSDB

To view the LSDB of a device:

![View OSPF LSDB](27_ospfPart2_18.png)

---